# Linux 应用程序开发技术

15.5 GCC 编辑器
15.5.1 C 语言程序的编译过程
gcc -E test.c -o test.i
gcc -S test.i -o test.s
gcc -c test.s -o test.o
gcc test.o -o test
简化的 GCC 命令：
gcc test.c -o test
15.5.2 GCC 基本用法
gcc [选项] [文件名]
默认情况下，GCC 会在系统默认的路径中（如 usr/lib）寻找所需的库文件，当使用 -L 选
项，会首先到-L 指定的目录下去寻找相关库文件。
15.6 GDB 调试器
15.6.1 GDB 的启动和退出
输入命令 “gdb 程序名“ 或者先输入 “gdb” ， 然后输入 “file 程序名” 15.6.2 调试前的准备
使一个可执行文件被 GDB 调试，需要在编译程序时加入“-g”，这个选项可以在 GCC 编译程
序时产生调试信息。
gcc -g test.c -o test
./test
若想要详细了解某个 gdb 命令的使用方法，可使用 help 命令“help list”和 help all“”
15.6.3 显示和查找源代码
调试时查看源代码可使用“list”命令：
list ： 每次调用该命令显示 10 行代码，若再次运行该命令，则显示接下来的 10 行
list m,n 显示从第 m 行到 n 行的代码
list 源文件:m,n 显示源文件中第 m 行到 n 行的代码
list 函数名 显示函数周围的代码
list 源文件:函数名 显示源文件中函数名指定的周围代码
可以在源文件中从当前行向后查找第一个匹配的字符串，命令格式：“search 字符
串””forward 字符串”。也可反向查找字符串，“reverse-search 字符串”。
15.6.4 执行程序
要使程序开始运行，在（gdb）的提示符下输入“run”或“r” 15.6.5 设置断点
1. break 行号 ： 将断点设置在某行
如，（gdb）break 4
Breakpoint 1 at 0*400525：file test.c line 4. 1 表示第一个断点，0*400525 是断点所在的内存地址
设置好断点后，可以输入“run”命令运行程序
2. break 函数名 ： 断点设置在函数名上
3. break 行号或函数名 if 条件 ： 通过条件设置断点
4. info breakpoints 命令 查看当前所有的断点
Num 表示断点的编号；
Type 表示断点的类型；
Disp 表示断点在生效一次后是否失去作用，如果是则为 dis，否则为 keep；
Enb 表示当前断点是否有效，如果是，y，否则为 n；
Address 表示终端所处的内存地址；
What 表示发生在哪个函数的第几行，“stop only if i==4”标明是一个条件断点。
5. disable 断点编号 ： 使断点失效
还可通过“enable”继续使其生效
6. 删除断点
clear 删除程序中的所有断点
clear 行号 删除此行的断点
clear 函数名 删除该函数的断点
clear 断点编号 删除指定编号的断点
15.6.6 查看和设置变量的值
执行到断点的时候，往往需要通过查看变量的值来了解当前程序的执行情况
1. 查看变量的值
print 变量名或表达式
2. 查看变量的类型
whatis 变量名或表达式，用于显示某个变量或表达式结果的数据类型
3. 设置变量的值
set variable 变量=值
print 变量=值
15.6.7 调试的控制
查看变量的值后，可以让程序继续运行。是要一步一步运行，还是让程序一直运行下去
1. kill 命令
用于结束当前程序的调试，输入该命令后，会询问是否退出当前程序的调试，输入 y 结束，
输入 n 继续调试。
2. continue 命令
让程序继续运行到下一个断点或运行完整个程序
如，使用 run 让程序运行到第 1 个断点处，查看变量 n 的值，接下来使用 continue 让程序
继续运行至第 2 个断点处，再查看 n 的值。
=
3. next 和 step 命令
单步调试功能，每次执行一条语句
next 命令会把该函数当作一条语句执行，不会进入函数的内部；
step 命令则会进入函数内部，继续单步调试程序。
使用 next 命令每次执行一条语句，执行一条语句后可以使用 print 命令查看变量的值。
4. nexti 和 stepi 命令
用于单步执行一条指令，而不是一条语句，对一条语句而言，往往对应多条指令。
如，对一条循环语句“for（i=0；i<6；i++）”而言，使用“nexti”或“stepi”命令，需要输入多
次才能执行完毕。
GDB 命令
list 缩写 l 显示多行源代码
break 缩写 b 设置断点
info 缩写 i 描述程序的状态
run 缩写 r 开始运行程序
display 缩写 disp 跟踪查看某个变量
step 缩写 s 执行下一条语句，若该语句为函数调用，则进入函数，执行其中的
第一条语句
next 缩写 n 执行下一条语句，若该语句为函数调用，则不会进入函数内部执行
print 缩写 p 打印内部变量值
continue 缩写 c 继续程序的运行，直到遇到下一个断点
set variable name=v 设置变量的值
start 缩写 st 开始执行程序，在 main 函数的第一条语句前面停下来
file 装入需要调试的程序
kill 缩写 k 终止正在调试的程序
watch 监视变量值的变化
backtrace 缩写 bt 查看函数调用信息
frame 缩写 f 查看栈帧
quit 缩写 q 退出 GDB 环境
15.7 make
make 命令是 GNU 工程化编译工具，用于编译大量互相关联的源代码，使用它可以实现项
目的工程化管理，提高开发效率。
make 工具可以用来维护程序模块关系和生成可执行程序。执行该命令时，将 make 工具的
编译指令放入一个名为 makefile（或 Makefile）的文件中，该文件定义了整个项目的编译
规则、模块之间的依赖关系和文件的编译顺序。
make 命令可以使整个项目的源文件进行自动编译，用户只需要运行一条命令，这种方式极
大的提高了软件的开发效率。
make 命令从 makefile 文件中获取模块之间的依赖关系。
15.7.1 makefile 文件的构成
一个 makefile 文件的基本单元是规则，一条规则指定一个或多个目标文件，目标文件后面
跟的是编译生成目标文件所依赖的文件或模块，最后是生成目标文件的命令。
规则格式如下：
目标文件列表 分隔符 依赖文件列表
[命令]
[命令] “[]”代表该项可选。
15.7.2 执行 makefile
当用户输入 make 命令后，首先在当前目录下寻找名为 makefile 或 Makefile 的文件。
1）头文件#include<my.h>和#include”my.h”中的<>和“”有什么区别？
答：<>表示编译器将在系统预设的头文件目录下搜索头文件；“”表示先在当前目录下搜索，
找不到时再去系统头文件目录下搜索头文件。 第 16 章 Web 服务器搭建、应用开发与部署
Linux 下，采用 Eclipse 开发工具，基于 MVC 的 Java Web 开发，使用当下较为流行的 SSM
框架进行演示。
16.1 Web 服务器搭建的准备
16.1.1 配置 Java
要先将 Linux 自带的 openJDK 卸载，后安装 Oracle 的 JDK
java -version 查看已安装的 Java 版本信息
rpm -qa | grep java 查找已安装的 openJDK 位置
之后逐一卸载，下载 JDK 压缩包
解压后，配置环境变量 gedit ~/.bashrc
bashrc 文件中配置 4 个环境变量：JAVA_HOME，JRE_HOME，PATH，CLASSPATH
配置完毕关闭文件，在终端执行 source ~/.bashrc 使环境变量立即生效
16.1.2 配置 MySQL
MySQL 的配置文件 my.cnf p350
#设置 MySQL 的安装目录 basedir
#设置 MySQL 数据库的数据存放目录 datadir